---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimWitnsLineCntrl
source: html/45ace0df-b382-c8b5-b77a-286eaad22f8b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimWitnsLineCntrl Property

"Witness Line Control"

## Syntax (C#)
```csharp
public static ForgeTypeId DimWitnsLineCntrl { get; }
```